docs/comp-sci/tex.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-10-24 Sun 11:57 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>TeX Notes</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">TeX Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#h-84848014-a2ce-403a-9dec-20a86af11ca5">1. Introduction</a></li>
<li><a href="#h-f706e3fa-e88f-4439-9095-907b9b20d0e2">2. Poor Man's LaTeX</a>
<ul>
<li><a href="#h-61eb6d82-0759-480a-ac89-743dd455f86d">2.1. Environments</a></li>
<li><a href="#h-481e8d2b-e5e1-41be-a892-ebba10a94b60">2.2. Equations</a></li>
</ul>
</li>
<li><a href="#h-9003bdc5-57ad-4ef9-aa76-5b45c8f1f8ab">3. Math Gallery</a>
<ul>
<li><a href="#h-024d8f89-6eec-4422-8e82-ba3e2e15a117">3.1. Normal Ordering Operators</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-h-84848014-a2ce-403a-9dec-20a86af11ca5" class="outline-2">
<h2 id="h-84848014-a2ce-403a-9dec-20a86af11ca5"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-h-84848014-a2ce-403a-9dec-20a86af11ca5">
<p>
These are random observations about TeX and LaTeX.
</p>
</div>
</div>

<div id="outline-container-h-f706e3fa-e88f-4439-9095-907b9b20d0e2" class="outline-2">
<h2 id="h-f706e3fa-e88f-4439-9095-907b9b20d0e2"><span class="section-number-2">2.</span> Poor Man's LaTeX</h2>
<div class="outline-text-2" id="text-h-f706e3fa-e88f-4439-9095-907b9b20d0e2">
<p>
I've been curious about how LaTeX is built out of TeX macros for a while
now. These are just some observations about it.
</p>
</div>

<div id="outline-container-h-61eb6d82-0759-480a-ac89-743dd455f86d" class="outline-3">
<h3 id="h-61eb6d82-0759-480a-ac89-743dd455f86d"><span class="section-number-3">2.1.</span> Environments</h3>
<div class="outline-text-3" id="text-h-61eb6d82-0759-480a-ac89-743dd455f86d">
<p>
Someone asked on tex.stackexchange about how environments in LaTeX are
implemented using only plain TeX. David Carlisle's <a href="https://tex.stackexchange.com/a/572575">answer</a> was quite
enlightening: <code>\begin{foo}</code> executes <code>\foo</code>, and <code>\end{foo}</code> executes
<code>\endfoo</code>. But this requires redefining plain TeX's <code>\end</code> primitive,
setting it to be <code>\@@end</code> in LaTeX.
</p>

<p>
This sparked a curiousity about LaTeX's implementation details. They can
be found, for texlive users, in
<code>/usr/share/texlive/texmf-dist/tex/latex-dev/base/latex.ltx</code> or somewhere
similar.
</p>

<p>
If one imitates LaTeX, and writes something like <code>\let\@@end\end</code>, then
one needs to redefine <code>\bye</code> to be something like:
</p>

<div class="org-src-container">
<pre class="src src-tex"><span class="org-keyword">\def</span>\<span class="org-function-name">makeatletter</span>{<span class="org-keyword">\catcode</span>`<span class="org-keyword">\@</span>11<span class="org-keyword">\relax</span>}
<span class="org-keyword">\def</span>\<span class="org-function-name">makeatother</span>{<span class="org-keyword">\catcode</span>`<span class="org-keyword">\@</span>12<span class="org-keyword">\relax</span>}
<span class="org-keyword">\makeatletter</span>
<span class="org-keyword">\let\@@end\end</span>
<span class="org-keyword">\outer\def\bye</span>{<span class="org-keyword">\par\vfill\supereject\@@end</span>}

<span class="org-comment-delimiter">% </span><span class="org-comment">define environment syntax</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">begin</span>#1{<span class="org-keyword">\begingroup\csname</span>#1<span class="org-keyword">\endcsname</span>}
<span class="org-keyword">\def</span>\<span class="org-function-name">end</span>#1{<span class="org-keyword">\csname</span> end#1<span class="org-keyword">\endcsname\endgroup</span>}
<span class="org-keyword">\makeatother</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-h-481e8d2b-e5e1-41be-a892-ebba10a94b60" class="outline-3">
<h3 id="h-481e8d2b-e5e1-41be-a892-ebba10a94b60"><span class="section-number-3">2.2.</span> Equations</h3>
<div class="outline-text-3" id="text-h-481e8d2b-e5e1-41be-a892-ebba10a94b60">
<p>
The implementation is fairly straightforward.
</p>

<div class="org-src-container">
<pre class="src src-tex"><span class="org-comment-delimiter">%% </span><span class="org-comment">LaTeX's implementation:</span>
<span class="org-comment-delimiter">%%</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">\def\stepcounter#1{%</span>
<span class="org-comment-delimiter">%%   </span><span class="org-comment">\addtocounter{#1}\@ne</span>
<span class="org-comment-delimiter">%%   </span><span class="org-comment">\begingroup</span>
<span class="org-comment-delimiter">%%     </span><span class="org-comment">\let\@elt\@stpelt</span>
<span class="org-comment-delimiter">%%     </span><span class="org-comment">\csname cl@#1\endcsname</span>
<span class="org-comment-delimiter">%%   </span><span class="org-comment">\endgroup}</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">\def\@definecounter#1{\expandafter\newcount\csname c@#1\endcsname</span>
<span class="org-comment-delimiter">%%      </span><span class="org-comment">\setcounter{#1}\z@</span>
<span class="org-comment-delimiter">%%      </span><span class="org-comment">\global\expandafter\let\csname cl@#1\endcsname\@empty</span>
<span class="org-comment-delimiter">%%      </span><span class="org-comment">\@addtoreset{#1}{@ckpt}%</span>
<span class="org-comment-delimiter">%%      </span><span class="org-comment">\global\expandafter\let\csname p@#1\endcsname\@empty</span>
<span class="org-comment-delimiter">%%      </span><span class="org-comment">\expandafter</span>
<span class="org-comment-delimiter">%%      </span><span class="org-comment">\gdef\csname the#1\expandafter\endcsname\expandafter</span>
<span class="org-comment-delimiter">%%           </span><span class="org-comment">{\expandafter\@arabic\csname c@#1\endcsname}}</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">stepcounter</span>#1{
    <span class="org-keyword">\expandafter\global\expandafter\advance\csname</span> c@#1<span class="org-keyword">\endcsname</span> by1
}
<span class="org-keyword">\def</span>\<span class="org-function-name">setcounter</span>#1#2{
    <span class="org-keyword">\expandafter\global\csname</span> c@#1<span class="org-keyword">\endcsname</span>=#2
}
<span class="org-keyword">\def</span>\<span class="org-function-name">@definecounter</span>#1{
    <span class="org-keyword">\expandafter\newcount\csname</span> c@#1<span class="org-keyword">\endcsname</span>
    <span class="org-keyword">\setcounter</span>{<span class="org-variable-name">#1</span>}{0}
    <span class="org-keyword">\expandafter</span>
    <span class="org-keyword">\gdef\csname</span> the#1<span class="org-keyword">\expandafter\endcsname\expandafter</span>
         {<span class="org-keyword">\expandafter\number\csname</span> c@#1<span class="org-keyword">\endcsname</span>}
}

<span class="org-keyword">\@definecounter</span>{equation}
<span class="org-keyword">\def</span>\<span class="org-function-name">equation</span>{$$<span class="org-keyword">\refstepcounter</span>{equation}}
<span class="org-keyword">\def</span>\<span class="org-function-name">endequation</span>{<span class="org-keyword">\eqno</span> <span class="org-keyword">\hbox</span>{<span class="org-keyword">\@eqnnum</span>}$$<span class="org-keyword">\@ignoretrue</span>}
<span class="org-keyword">\def</span>\<span class="org-function-name">@eqnnum</span>{{<span class="org-keyword">\normalfont</span> <span class="org-keyword">\normalcolor</span> (<span class="org-keyword">\theequation</span>)}}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-h-9003bdc5-57ad-4ef9-aa76-5b45c8f1f8ab" class="outline-2">
<h2 id="h-9003bdc5-57ad-4ef9-aa76-5b45c8f1f8ab"><span class="section-number-2">3.</span> Math Gallery</h2>
<div class="outline-text-2" id="text-h-9003bdc5-57ad-4ef9-aa76-5b45c8f1f8ab">
</div>

<div id="outline-container-h-024d8f89-6eec-4422-8e82-ba3e2e15a117" class="outline-3">
<h3 id="h-024d8f89-6eec-4422-8e82-ba3e2e15a117"><span class="section-number-3">3.1.</span> Normal Ordering Operators</h3>
<div class="outline-text-3" id="text-h-024d8f89-6eec-4422-8e82-ba3e2e15a117">
<p>
In Quantum Field Theory (and Vertex Operator Algebras, and related
subjects), we need normal ordering of operators. This has been discussed
at least <a href="https://tex.stackexchange.com/q/214347">once</a> on tex.stackexchange, and the answers are quite good.</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-10-24 Sun 10:23.</p>
</div>
</body>
</html>